-- MySQL dump 10.13  Distrib 8.0.19, for osx10.14 (x86_64)
--
-- Host: localhost    Database: personal
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `gains`
--

DROP TABLE IF EXISTS `gains`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `gains` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `date` date NOT NULL,
  `channel` varchar(20) NOT NULL,
  `money` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=261 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `gains`
--

LOCK TABLES `gains` WRITE;
/*!40000 ALTER TABLE `gains` DISABLE KEYS */;
INSERT INTO `gains` VALUES (1,'Qier','2020-02-28','Alipay',10.63),(2,'Qier','2020-02-29','Alipay',7.6),(3,'Qier','2020-03-01','Alipay',0.04),(4,'Qier','2020-03-02','Alipay',4.92),(5,'Qier','2020-03-03','Alipay',12.81),(6,'Qier','2020-03-04','Alipay',3.72),(7,'Qier','2020-03-05','Alipay',15.47),(8,'Qier','2020-03-06','Alipay',9.83),(9,'Qier','2020-03-07','Alipay',10.76),(10,'Qier','2020-03-09','Alipay',4.81),(11,'Qier','2020-03-08','Alipay',0.04),(12,'Qier','2020-03-12','Alipay',-2.42),(13,'Qier','2020-02-28','CMB',10.71),(14,'Qier','2020-03-11','Alipay',-0.12),(15,'Qier','2020-03-10','Alipay',27.25),(16,'Qier','2020-02-29','CMB',-1.6),(17,'Qier','2020-03-01','CMB',4.45),(18,'Qier','2020-03-02','CMB',4.44),(19,'Qier','2020-03-03','CMB',10.46),(20,'Qier','2020-03-04','CMB',10.49),(21,'Qier','2020-03-05','CMB',10.49),(22,'Qier','2020-03-06','CMB',16.51),(23,'Qier','2020-03-07','CMB',4.41),(24,'Qier','2020-03-08','CMB',4.41),(25,'Qier','2020-03-09','CMB',4.41),(26,'Qier','2020-03-10','CMB',10.5),(27,'Qier','2020-03-11','CMB',4.35),(28,'Qier','2020-03-12','CMB',4.27),(29,'Jason','2020-02-28','Alipay',20.72),(30,'Jason','2020-02-29','Alipay',-66.39),(31,'Jason','2020-03-01','Alipay',0.03),(32,'Jason','2020-03-02','Alipay',5.04),(33,'Jason','2020-03-03','Alipay',73.12),(34,'Jason','2020-03-04','Alipay',17.54),(35,'Jason','2020-03-05','Alipay',19.48),(36,'Jason','2020-03-06','Alipay',43.94),(37,'Jason','2020-03-07','Alipay',-14.34),(38,'Jason','2020-03-08','Alipay',0.03),(39,'Jason','2020-03-09','Alipay',6.25),(40,'Jason','2020-03-10','Alipay',-49.5),(41,'Jason','2020-03-11','Alipay',44.25),(42,'Jason','2020-03-12','Alipay',-32.74),(43,'Jason','2020-02-28','CMB',21.85),(44,'Jason','2020-02-29','CMB',-9.1),(45,'Jason','2020-03-01','CMB',6.23),(46,'Jason','2020-03-02','CMB',6.22),(47,'Jason','2020-03-03','CMB',21.51),(48,'Jason','2020-03-04','CMB',21.54),(49,'Jason','2020-03-05','CMB',21.54),(50,'Jason','2020-03-06','CMB',36.82),(51,'Jason','2020-03-07','CMB',6.18),(52,'Jason','2020-03-08','CMB',6.18),(53,'Jason','2020-03-09','CMB',6.18),(54,'Jason','2020-03-10','CMB',21.56),(55,'Jason','2020-03-11','CMB',6.09),(56,'Jason','2020-03-12','CMB',5.98),(57,'Jason','2020-03-13','Alipay',-38.84),(58,'Jason','2020-03-13','CMB',-9.25),(59,'Qier','2020-03-13','Alipay',2.41),(60,'Qier','2020-03-13','CMB',-1.71),(61,'Jason','2020-03-14','Alipay',-41.11),(62,'Jason','2020-03-14','CMB',-24.39),(63,'Qier','2020-03-14','Alipay',-13.82),(64,'Qier','2020-03-14','CMB',-7.63),(65,'Jason','2020-03-15','Alipay',0.03),(66,'Jason','2020-03-15','CMB',6.05),(67,'Qier','2020-03-15','Alipay',0.04),(68,'Qier','2020-03-15','CMB',4.32),(69,'Jason','2020-03-16','Alipay',6.02),(70,'Jason','2020-03-16','CMB',6.05),(71,'Qier','2020-03-16','Alipay',4.64),(72,'Qier','2020-03-16','CMB',4.32),(73,'Jason','2020-03-17','Alipay',-97.62),(74,'Jason','2020-03-17','CMB',-24.51),(75,'Qier','2020-03-17','CMB',-7.7),(76,'Qier','2020-03-17','Alipay',0.22),(77,'Jason','2020-03-18','Alipay',-9.07),(78,'Jason','2020-03-18','CMB',-24.53),(79,'Qier','2020-03-18','Alipay',-6.25),(80,'Qier','2020-03-18','CMB',-7.73),(81,'Jason','2020-03-19','Alipay',-7.37),(82,'Jason','2020-03-19','CMB',6.27),(83,'Qier','2020-03-19','Alipay',6.48),(84,'Qier','2020-03-19','CMB',4.48),(85,'Jason','2020-03-20','Alipay',-0.06),(86,'Jason','2020-03-20','CMB',6.43),(87,'Qier','2020-03-20','Alipay',2.54),(88,'Qier','2020-03-20','CMB',4.59),(89,'Jason','2020-03-21','Alipay',12.64),(90,'Jason','2020-03-21','CMB',6.25),(91,'Qier','2020-03-21','Alipay',4.98),(92,'Qier','2020-03-21','CMB',13.45),(93,'Jason','2020-03-22','Alipay',0.14),(94,'Jason','2020-03-22','CMB',6.16),(95,'Qier','2020-03-22','Alipay',0.04),(96,'Qier','2020-03-22','CMB',13.15),(97,'Jason','2020-03-23','Alipay',5.8),(98,'Jason','2020-03-23','CMB',6.15),(99,'Qier','2020-03-23','Alipay',4.4),(100,'Qier','2020-03-23','CMB',13.14),(101,'Jason','2020-03-24','Alipay',26.43),(102,'Jason','2020-03-24','CMB',7.98),(103,'Qier','2020-03-24','Alipay',20.21),(104,'Qier','2020-03-24','CMB',13.48),(105,'Jason','2020-03-25','Alipay',19.26),(106,'Jason','2020-03-25','CMB',8.54),(107,'Qier','2020-03-25','Alipay',16.2),(108,'Qier','2020-03-25','CMB',13.86),(109,'Jason','2020-03-26','Alipay',6.34),(110,'Jason','2020-03-26','CMB',8.11),(111,'Qier','2020-03-26','Alipay',4.37),(112,'Qier','2020-03-26','CMB',13.82),(113,'Jason','2020-03-27','Alipay',11.14),(114,'Jason','2020-03-27','CMB',8.03),(115,'Qier','2020-03-27','Alipay',9.24),(116,'Qier','2020-03-27','CMB',14.03),(117,'Jason','2020-03-28','Alipay',9.52),(118,'Jason','2020-03-28','CMB',8.14),(119,'Qier','2020-03-28','Alipay',7.94),(120,'Qier','2020-03-28','CMB',14.02),(121,'Jason','2020-03-29','Alipay',0.15),(122,'Jason','2020-03-29','CMB',7.46),(123,'Qier','2020-03-29','Alipay',0.03),(124,'Qier','2020-03-29','CMB',12.87),(125,'Jason','2020-03-30','Alipay',5.38),(126,'Jason','2020-03-30','CMB',7.45),(127,'Qier','2020-03-30','Alipay',4.04),(128,'Qier','2020-03-30','CMB',12.85),(129,'Jason','2020-03-31','Alipay',10.87),(130,'Jason','2020-03-31','CMB',8.23),(131,'Qier','2020-03-31','Alipay',6.32),(132,'Qier','2020-03-31','CMB',14.28),(133,'Jason','2020-04-01','Alipay',9.45),(134,'Jason','2020-04-01','CMB',8.09),(135,'Qier','2020-04-01','Alipay',7.25),(136,'Qier','2020-04-01','CMB',14.4),(137,'Jason','2020-04-02','Alipay',13.18),(138,'Jason','2020-04-02','CMB',8.1),(139,'Qier','2020-04-02','Alipay',10.24),(140,'Qier','2020-04-02','CMB',13.73),(141,'Jason','2020-04-03','Alipay',20.19),(142,'Jason','2020-04-03','CMB',8.21),(143,'Qier','2020-04-03','Alipay',17.13),(144,'Qier','2020-04-03','CMB',13.97),(145,'Jason','2020-04-04','Alipay',5.54),(146,'Jason','2020-04-04','CMB',9.99),(147,'Qier','2020-04-04','Alipay',4.02),(148,'Qier','2020-04-04','CMB',13.68),(149,'Jason','2020-04-05','Alipay',0.14),(150,'Jason','2020-04-05','CMB',9.39),(151,'Qier','2020-04-05','Alipay',0.04),(152,'Qier','2020-04-05','CMB',12.87),(153,'Jason','2020-04-06','Alipay',0.14),(154,'Jason','2020-04-06','CMB',9.39),(155,'Qier','2020-04-06','Alipay',0.04),(156,'Qier','2020-04-06','CMB',12.87),(157,'Jason','2020-04-07','Alipay',7.01),(158,'Jason','2020-04-07','CMB',9.39),(159,'Qier','2020-04-07','Alipay',5.29),(160,'Qier','2020-04-07','CMB',12.87),(161,'Jason','2020-04-08','Alipay',90.89),(162,'Jason','2020-04-08','CMB',10.75),(163,'Qier','2020-04-08','Alipay',78.17),(164,'Qier','2020-04-08','CMB',4.99),(165,'Jason','2020-04-09','Alipay',50.28),(166,'Jason','2020-04-09','CMB',10.63),(167,'Qier','2020-04-09','Alipay',45.51),(168,'Qier','2020-04-09','CMB',4.91),(169,'Jason','2020-04-10','Alipay',29.59),(170,'Jason','2020-04-10','CMB',10.55),(171,'Qier','2020-04-10','Alipay',24.91),(172,'Qier','2020-04-10','CMB',4.8),(173,'Jason','2020-04-11','Alipay',3.63),(174,'Jason','2020-04-11','CMB',10.18),(175,'Qier','2020-04-11','Alipay',2.12),(176,'Qier','2020-04-11','CMB',4.65),(177,'Qier','2020-04-12','Alipay',0.04),(178,'Qier','2020-04-12','CMB',4.41),(179,'Jason','2020-04-12','Alipay',0.13),(180,'Jason','2020-04-12','CMB',9.64),(181,'Jason','2020-04-13','Alipay',4.9),(182,'Jason','2020-04-13','CMB',9.4),(183,'Jason','2020-04-14','Alipay',11.05),(184,'Jason','2020-04-14','CMB',9.7),(185,'Qier','2020-04-13','Alipay',3.69),(186,'Qier','2020-04-13','CMB',4.31),(187,'Qier','2020-04-14','Alipay',7.23),(188,'Qier','2020-04-14','CMB',4.38),(189,'Jason','2020-04-15','Alipay',10.76),(190,'Jason','2020-04-15','CMB',9.95),(191,'Qier','2020-04-15','Alipay',8.15),(192,'Qier','2020-04-15','CMB',4.54),(193,'Jason','2020-04-16','Alipay',15.2),(194,'Jason','2020-04-16','CMB',10.05),(195,'Qier','2020-04-16','Alipay',12.13),(196,'Qier','2020-04-16','CMB',4.58),(197,'Jason','2020-04-17','Alipay',16.62),(198,'Jason','2020-04-17','CMB',9.97),(199,'Qier','2020-04-17','Alipay',15.01),(200,'Qier','2020-04-17','CMB',4.54),(201,'Jason','2020-04-18','Alipay',12.25),(202,'Jason','2020-04-18','CMB',10.09),(203,'Qier','2020-04-18','Alipay',9.87),(204,'Qier','2020-04-18','CMB',4.6),(205,'Jason','2020-04-19','Alipay',0.12),(206,'Jason','2020-04-19','CMB',9.35),(207,'Qier','2020-04-19','Alipay',0.04),(208,'Qier','2020-04-19','CMB',4.29),(209,'Jason','2020-04-20','Alipay',4.73),(210,'Jason','2020-04-20','CMB',9.3),(211,'Qier','2020-04-20','Alipay',3.55),(212,'Qier','2020-04-20','CMB',4.26),(213,'Jason','2020-04-21','Alipay',14.34),(214,'Jason','2020-04-21','CMB',9.82),(215,'Qier','2020-04-21','Alipay',10.19),(216,'Qier','2020-04-21','CMB',4.44),(217,'Jason','2020-04-22','Alipay',8.5),(218,'Jason','2020-04-22','CMB',9.98),(219,'Jason','2020-04-23','Alipay',11.94),(220,'Jason','2020-04-23','CMB',9.72),(221,'Qier','2020-04-22','Alipay',7.12),(222,'Qier','2020-04-22','CMB',4.55),(223,'Qier','2020-04-23','Alipay',10.03),(224,'Qier','2020-04-23','CMB',4.4),(225,'Jason','2020-04-24','Alipay',23.16),(226,'Jason','2020-04-25','Alipay',11.6),(227,'Jason','2020-04-26','Alipay',0.02),(228,'Jason','2020-04-24','CMB',9.84),(229,'Jason','2020-04-26','CMB',9.34),(230,'Jason','2020-04-25','CMB',10),(231,'Qier','2020-04-26','Alipay',0.09),(232,'Qier','2020-04-25','Alipay',9.97),(233,'Qier','2020-04-24','Alipay',20.82),(234,'Qier','2020-04-26','CMB',4.27),(235,'Qier','2020-04-24','CMB',4.47),(236,'Qier','2020-04-25','CMB',4.51),(237,'Jason','2020-04-27','Alipay',4.56),(238,'Jason','2020-04-27','CMB',10.08),(239,'Qier','2020-04-27','Alipay',3.32),(240,'Qier','2020-04-27','CMB',4.57),(241,'Jason','2020-04-28','Alipay',10.69),(242,'Jason','2020-04-28','CMB',9.89),(243,'Qier','2020-04-28','Alipay',7.16),(244,'Qier','2020-04-28','CMB',4.5),(245,'Jason','2020-04-29','Alipay',10.4),(246,'Jason','2020-04-29','CMB',10.2),(247,'Qier','2020-04-29','Alipay',7.15),(248,'Qier','2020-04-29','CMB',4.63),(249,'Jason','2020-04-30','Alipay',6.99),(250,'Jason','2020-04-30','CMB',10.01),(251,'Qier','2020-04-30','Alipay',5.15),(252,'Qier','2020-04-30','CMB',4.53),(253,'Jason','2020-05-01','Alipay',6.98),(254,'Jason','2020-05-01','CMB',9.77),(255,'Qier','2020-05-01','Alipay',6.06),(256,'Qier','2020-05-01','CMB',4.41),(257,'Jason','2020-05-02','Alipay',0.01),(258,'Jason','2020-05-02','CMB',8.85),(259,'Qier','2020-05-02','Alipay',0.09),(260,'Qier','2020-05-02','CMB',4.02);
/*!40000 ALTER TABLE `gains` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `steps`
--

DROP TABLE IF EXISTS `steps`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `steps` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `date` date NOT NULL,
  `steps` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `steps`
--

LOCK TABLES `steps` WRITE;
/*!40000 ALTER TABLE `steps` DISABLE KEYS */;
INSERT INTO `steps` VALUES (1,'Jason','2020-04-18',16126),(2,'Jason','2020-04-17',13000),(3,'Jason','2020-04-16',12389),(4,'Jason','2020-04-15',12324),(5,'Jason','2020-04-14',4882),(6,'Jason','2020-04-19',7903),(7,'Jason','2020-04-13',12517);
/*!40000 ALTER TABLE `steps` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `temperature`
--

DROP TABLE IF EXISTS `temperature`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `temperature` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `time` datetime NOT NULL,
  `value` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=130 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `temperature`
--

LOCK TABLES `temperature` WRITE;
/*!40000 ALTER TABLE `temperature` DISABLE KEYS */;
INSERT INTO `temperature` VALUES (1,'Jason','2020-02-26 09:30:00',36.5),(2,'Jason','2020-02-26 17:30:00',36.9),(3,'Jason','2020-02-26 20:00:00',36.8),(4,'Jason','2020-02-26 21:30:00',36.5),(5,'Jason','2020-02-27 08:00:00',36.4),(6,'Jason','2020-02-27 12:00:00',36.8),(7,'Jason','2020-02-27 14:00:00',36.7),(8,'Jason','2020-02-27 17:30:00',36.7),(9,'Jason','2020-02-27 20:00:00',36.7),(10,'Jason','2020-02-27 21:30:00',36.4),(11,'Jason','2020-02-28 08:00:00',36.2),(12,'Jason','2020-02-28 14:30:00',36.5),(13,'Jason','2020-02-28 16:30:00',36.7),(14,'Jason','2020-02-29 09:00:00',36.6),(15,'Jason','2020-02-29 12:30:00',36.8),(16,'Jason','2020-02-29 15:00:00',36.9),(17,'Jason','2020-02-29 18:00:00',36.9),(18,'Jason','2020-02-29 22:30:00',36.2),(19,'Jason','2020-03-01 09:00:00',36.2),(20,'Jason','2020-03-01 15:00:00',36.4),(21,'Jason','2020-03-01 18:30:00',36.6),(22,'Jason','2020-03-01 23:00:00',36.1),(23,'Jason','2020-03-02 09:00:00',36.2),(24,'Jason','2020-03-02 13:30:00',36.4),(25,'Jason','2020-03-02 18:00:00',36.4),(26,'Jason','2020-03-02 22:30:00',36.2),(27,'Jason','2020-03-03 08:30:00',36.4),(28,'Jason','2020-03-03 15:00:00',36.7),(29,'Jason','2020-03-03 21:30:00',36.6),(30,'Jason','2020-03-04 07:30:00',35.9),(31,'Jason','2020-03-04 09:30:00',36.4),(32,'Jason','2020-03-04 12:00:00',36.5),(33,'Jason','2020-03-04 15:30:00',36.7),(34,'Jason','2020-03-04 19:00:00',36.5),(35,'Jason','2020-03-04 21:30:00',36.7),(36,'Jason','2020-03-05 09:00:00',36.5),(37,'Jason','2020-03-05 12:00:00',36.1),(38,'Jason','2020-03-05 22:00:00',36.3),(39,'Jason','2020-03-06 09:00:00',36),(40,'Jason','2020-03-06 15:00:00',36.7),(41,'Jason','2020-03-06 18:00:00',36.6),(42,'Jason','2020-03-06 22:30:00',36.6),(43,'Jason','2020-03-07 08:00:00',35.9),(44,'Jason','2020-03-07 13:30:00',36.6),(45,'Jason','2020-03-07 21:00:00',36.4),(46,'Jason','2020-03-08 09:30:00',36.3),(47,'Jason','2020-03-08 21:00:00',36.4),(48,'Jason','2020-03-09 09:30:00',36.4),(49,'Jason','2020-03-09 17:30:00',36.6),(50,'Jason','2020-03-09 21:00:00',36.7),(51,'Jason','2020-03-10 09:30:00',36.3),(52,'Jason','2020-03-10 13:00:00',36.7),(53,'Jason','2020-03-10 18:00:00',36.6),(54,'Jason','2020-03-10 22:30:00',36.3),(55,'Jason','2020-03-11 09:00:00',36.5),(56,'Jason','2020-03-11 15:00:00',36.8),(58,'Qier','2020-02-26 09:30:00',36.3),(59,'Qier','2020-02-26 17:30:00',36.4),(60,'Qier','2020-03-03 11:00:00',36.6),(61,'Qier','2020-03-03 16:30:00',36.3),(62,'Qier','2020-03-04 07:30:00',37.1),(63,'Qier','2020-03-04 09:30:00',36.9),(64,'Qier','2020-03-04 12:00:00',36.6),(65,'Qier','2020-03-04 15:30:00',36.8),(66,'Qier','2020-03-04 19:00:00',36.8),(67,'Qier','2020-03-05 10:30:00',36.6),(68,'Jason','2020-03-11 23:30:00',36.2),(69,'Jason','2020-03-12 09:00:00',36.1),(70,'Jason','2020-03-12 18:00:00',36.8),(71,'Jason','2020-03-12 20:30:00',36.9),(72,'Jason','2020-03-12 23:30:00',36.4),(73,'Jason','2020-03-13 09:00:00',36.5),(74,'Jason','2020-03-13 13:00:00',36.8),(75,'Jason','2020-03-13 17:30:00',36.9),(76,'Jason','2020-03-13 21:00:00',36.2),(77,'Jason','2020-03-14 09:30:00',36.2),(78,'Jason','2020-03-15 10:00:00',36.1),(79,'Jason','2020-03-15 22:00:00',36.1),(80,'Jason','2020-03-16 10:00:00',36.4),(81,'Jason','2020-03-17 00:00:00',36.4),(82,'Jason','2020-03-17 09:00:00',36.2),(83,'Jason','2020-03-18 09:30:00',36.3),(84,'Jason','2020-03-19 10:00:00',36.5),(85,'Jason','2020-03-19 16:30:00',36.4),(86,'Jason','2020-03-20 10:00:00',36.3),(87,'Jason','2020-03-21 09:30:00',36.4),(88,'Jason','2020-03-22 11:00:00',36.6),(89,'Jason','2020-03-23 10:00:00',36.6),(90,'Jason','2020-03-24 09:30:00',36),(91,'Jason','2020-03-25 09:30:00',36.4),(92,'Jason','2020-03-26 10:00:00',36.4),(93,'Jason','2020-03-27 09:25:16',36.3),(94,'Jason','2020-03-28 09:20:00',36.1),(95,'Jason','2020-03-28 23:13:28',35.8),(96,'Jason','2020-03-29 11:26:59',35.9),(97,'Jason','2020-03-30 09:55:00',36.4),(98,'Jason','2020-03-31 09:46:00',36.2),(99,'Jason','2020-04-01 09:51:00',36.4),(100,'Jason','2020-04-02 09:50:00',36.1),(101,'Jason','2020-04-03 10:05:00',36.6),(102,'Jason','2020-04-04 10:44:42',36.2),(103,'Qier','2020-04-06 11:00:00',36.8),(104,'Jason','2020-04-06 11:13:38',36.4),(105,'Jason','2020-04-06 20:16:26',36.7),(106,'Jason','2020-04-07 09:42:10',36.2),(107,'Qier','2020-04-07 12:15:00',36.8),(108,'Jason','2020-04-07 22:39:34',36.3),(109,'Jason','2020-04-08 10:56:20',36.2),(110,'Jason','2020-04-09 09:56:56',36.2),(111,'Jason','2020-04-10 10:04:08',36.3),(112,'Jason','2020-04-11 23:04:07',36.4),(113,'Jason','2020-04-12 20:27:27',36.6),(114,'Jason','2020-04-13 10:13:44',36),(115,'Jason','2020-04-14 09:56:23',36.4),(116,'Jason','2020-04-15 10:00:28',36.3),(117,'Jason','2020-04-16 10:25:27',36.2),(118,'Jason','2020-04-17 09:28:18',36.3),(119,'Jason','2020-04-18 16:30:00',36.7),(120,'Jason','2020-04-18 22:49:30',36.2),(121,'Qier','2020-04-19 00:47:57',36.5),(122,'Jason','2020-04-19 09:07:00',36.2),(123,'Jason','2020-04-20 09:37:07',36.3),(124,'Jason','2020-04-21 10:05:28',36.2),(125,'Jason','2020-04-22 19:48:02',36.4),(126,'Jason','2020-04-23 10:04:49',36.4),(127,'Jason','2020-04-26 10:25:49',36.3),(128,'Jason','2020-04-27 10:42:21',36.4),(129,'Jason','2020-04-28 09:50:21',36.2);
/*!40000 ALTER TABLE `temperature` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `todo_list`
--

DROP TABLE IF EXISTS `todo_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `todo_list` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(200) NOT NULL,
  `description` text,
  `date` date NOT NULL,
  `status` int DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `todo_list`
--

LOCK TABLES `todo_list` WRITE;
/*!40000 ALTER TABLE `todo_list` DISABLE KEYS */;
INSERT INTO `todo_list` VALUES (1,'特殊快件中转/派件查询条件托寄物改为托寄物类型','特殊快件中转/派件查询条件托寄物改为托寄物类型','2020-04-01',2),(2,'未及时提货异常预警运单号增加链接跳转到快件查询','【中转】未及时提货异常预警运单号增加链接跳转到【快件】快件查询','2020-04-01',2),(3,'特殊快件中转明细查询条件增加“全部”选项','特殊快件中转明细查询条件增加“全部”选项','2020-04-01',2),(4,'特殊快件中转明细查询条件增加运单号','特殊快件中转明细查询条件增加运单号','2020-04-01',2),(5,'Table筛选组件讨论',NULL,'2020-04-01',2),(6,'特殊快件中转明细查询条件查询维度默认“全部”',NULL,'2020-04-02',2),(7,'特殊快件中转明细运单号增加链接跳转到快件查询','','2020-04-02',2),(8,'Table筛选组件UI与逻辑联通','将Table筛选组件的UI层与逻辑层联通起来。','2020-04-03',2),(9,'Write a loader for webpack','It\'s time to learn how to write loaders for webpack. If possible, push to npm.','2020-04-06',0),(10,'Write a plugin for webpack','It\'s time to learn how to write plugins for webpack. If possible, push to npm.','2020-04-06',0),(11,'Table筛选组件完成初步重构','Table筛选组件完成了初步的重构，对齐了之前改成树形结构的功能，同时完成了相关个别页面的调整。后续可在此基础上实现字段显示与查询条件绑定及特定条件下禁止勾选等功能。','2020-04-07',2),(12,'415版本收派环节需求项梳理','重点梳理哪些需求是纯前端可以完成的，哪些是需要接口及接口文档支持的，哪些是不确定这期会完成的。','2020-04-08',2),(13,'【收件预警监控-收件仓库监控】查询结果新增“建包票数”','【收件预警监控-收件仓库监控】查询结果新增“建包票数”，可下钻至【收件仓库明细预警】','2020-04-08',2),(14,'Table组件提供getShowColumns方法供外部调用','Table组件提供getShowColumns方法供外部调用，可获知当前显示的字段','2020-04-09',2),(19,'组织选择组件开发启动','组织选择组件开发启动，计划今天完成10%','2020-04-22',0);
/*!40000 ALTER TABLE `todo_list` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-02 23:59:11
